### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [3]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv(file_to_load)
# purchase_data_df.describe()

## Player Count

In [4]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

* Display the total number of players

In [5]:

total_players = len(purchase_data_df["SN"].unique())
total_players_df = pd.DataFrame({"Total Players": [total_players]})
total_players_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [6]:
unique = len(purchase_data_df["Item ID"].unique())
avg_price = purchase_data_df["Price"].mean()
total_purchases = len(purchase_data_df)
total_revenue = purchase_data_df["Price"].sum()
summary_df = pd.DataFrame({"Number of Unique Items": [unique],
                          "Average Price": [avg_price],
                          "Number of Purchases": [total_purchases],
                          "Total Revenue": [total_revenue]})
summary_df["Average Price"] = summary_df["Average Price"].map("${:,.2f}".format)
summary_df["Total Revenue"] = summary_df["Total Revenue"].map("${:,.2f}".format)
summary_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $3.05                  780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [7]:
# The stmt below shows all the unique values in 'gender'
# purchase_data_df["Gender"].unique()

# The stmt below puts unique names only - into a list
# unique_players_df = purchase_data_df.SN.unique()

# The stmts below sorts the dataframe 
purchase_data_df.sort_values("SN", inplace=True)

In [8]:
#  not sure how to take the 'unique' players and create the dataframe I need
# unique_players_df = purchase_data_df["SN"].unique()

# drop_duplicates works with the right parameters

unique_players_df = purchase_data_df.drop_duplicates(subset="SN")

In [9]:
# Display an overview of the Gender column (series)
# Normalize=False gives the count of the occurrance.  The default is False.  The code below creates a series

gender_demographics = unique_players_df['Gender'].value_counts(normalize=False)

#create a data frame out of the gender demographics series and add a formatted caclulated column

gender_demographics_df = pd.DataFrame(gender_demographics)
gender_demographics_df['Percentage of Players'] = gender_demographics_df["Gender"] / total_players * 100
gender_demographics_df["Percentage of Players"] = gender_demographics_df["Percentage of Players"].map("{:.2f}%".format)
gender_demographics_rename_df = gender_demographics_df.rename(columns={"Gender":"Total Count"})
gender_demographics_rename_df

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [10]:
# create a reduced dataframe with only the columns I need  (male and female)

reduced_df = purchase_data_df.loc[:,["Purchase ID","SN","Gender","Price"]]
reduced_df

     Purchase ID            SN  Gender  Price
467          467  Adairialis76    Male   2.28
142          142   Adastirin33  Female   4.48
388          388        Aeda94    Male   4.91
28            28        Aela59    Male   4.32
630          630     Aelaria33    Male   1.79
..           ...           ...     ...    ...
54            54    Zhisrisu83    Male   4.35
141          141    Zhisrisu83    Male   3.54
560          560     Zontibe81    Male   2.48
442          442     Zontibe81    Male   3.79
17            17     Zontibe81    Male   1.76

[780 rows x 4 columns]

In [11]:
##### create a dataframe with only females  

reduced_female_df = reduced_df.loc[(reduced_df["Gender"] == 'Female')]

In [12]:
# There are 81 unique females
unique_females = len(reduced_female_df["SN"].unique())

In [13]:
# There are 113 unique females purchases
unique_female_purchases = len(reduced_female_df["Purchase ID"].unique())

In [14]:
# Female total purchase value
total_female_purchase_price = reduced_female_df["Price"].sum()

In [15]:
# avg female purchase price
avg_female_purchase_price = total_female_purchase_price / unique_female_purchases

In [16]:
# avg female total purchase per person
avg_total_per_female = total_female_purchase_price / unique_females
avg_total_per_female

4.468395061728395

In [17]:
##### create a dataframe with only males  

reduced_male_df = reduced_df.loc[(reduced_df["Gender"] == 'Male')]

# There are 484 unique males
unique_males = len(reduced_male_df["SN"].unique())
unique_males

484

In [18]:
# There are 652 unique male purchases
unique_male_purchases = len(reduced_male_df["Purchase ID"].unique())
unique_male_purchases

652

In [19]:
# Male total purchase value
total_male_purchase_price = reduced_male_df["Price"].sum()
total_male_purchase_price

1967.64

In [20]:
# avg male purchase price
avg_male_purchase_price = total_male_purchase_price / unique_male_purchases
avg_male_purchase_price

3.0178527607361967

In [21]:
# avg male total purchase per person
avg_total_per_male = total_male_purchase_price / unique_males
avg_total_per_male

4.065371900826446

In [22]:
##### create a dataframe with only 'other/non-disclosed' 

reduced_other_df = reduced_df.loc[(reduced_df["Gender"] == 'Other / Non-Disclosed')]

# There are 11 unique others
unique_other = len(reduced_other_df["SN"].unique())
unique_other

11

In [23]:
# There are 15 unique 'other' purchases
unique_other_purchases = len(reduced_other_df["Purchase ID"].unique())
unique_other_purchases

15

In [24]:
# 'Other' total purchase value
total_other_purchase_price = reduced_other_df["Price"].sum()
total_other_purchase_price

50.190000000000005

In [25]:
# avg 'other' purchase price
avg_other_purchase_price = total_other_purchase_price / unique_other_purchases
avg_other_purchase_price

3.3460000000000005

In [26]:
# avg other total purchase per person
avg_total_per_other = total_other_purchase_price / unique_other
avg_total_per_other

4.562727272727273

In [27]:
####  Create the summary dataframe - Purchasing Analysis by Gender

purch_anal_summary_df = pd.DataFrame({"Gender":["Female", "Male", "Other / Non-Disclosed"],
                                      "Purchase Count":[unique_female_purchases, 
                                                        unique_male_purchases,
                                                        unique_other_purchases],
                                      "Average Purchase Price":[avg_female_purchase_price,
                                                                avg_male_purchase_price,
                                                               avg_other_purchase_price],
                                      "Total Purchase Value":[total_female_purchase_price,
                                                             total_male_purchase_price,
                                                             total_other_purchase_price],
                                      "Avg Total Purchase per Person":[avg_total_per_female,
                                                                      avg_total_per_male,
                                                                      avg_total_per_other]})
                                      
purch_anal_summary_df["Average Purchase Price"] = purch_anal_summary_df["Average Purchase Price"].map("${:.2f}".format)
purch_anal_summary_df["Total Purchase Value"] = purch_anal_summary_df["Total Purchase Value"].map("${:.2f}".format)
purch_anal_summary_df["Avg Total Purchase per Person"] = purch_anal_summary_df["Avg Total Purchase per Person"].map("${:.2f}".format)
purch_anal_summary_df.set_index('Gender')

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,$1967.64,$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [28]:
# create a reduced dataframe with only the columns I care about  (SN, Age) - 780 rows

player_age_df = purchase_data_df.loc[:,["SN","Age"]]
player_age_df

               SN  Age
467  Adairialis76   16
142   Adastirin33   35
388        Aeda94   17
28         Aela59   21
630     Aelaria33   23
..            ...  ...
54     Zhisrisu83   10
141    Zhisrisu83   10
560     Zontibe81   21
442     Zontibe81   21
17      Zontibe81   21

[780 rows x 2 columns]

In [29]:
###  Set up bins to determine Age Demographics Report
# Create a new dataframe

bins = [0, 9, 14, 19, 24, 29, 34, 39, 80]

group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

player_age_df["Age Demographics"] = pd.cut(player_age_df["Age"], bins, labels=group_names,include_lowest=True)
player_age_df

               SN  Age Age Demographics
467  Adairialis76   16            15-19
142   Adastirin33   35            35-39
388        Aeda94   17            15-19
28         Aela59   21            20-24
630     Aelaria33   23            20-24
..            ...  ...              ...
54     Zhisrisu83   10            10-14
141    Zhisrisu83   10            10-14
560     Zontibe81   21            20-24
442     Zontibe81   21            20-24
17      Zontibe81   21            20-24

[780 rows x 3 columns]

In [30]:
# drop duplicate players

player_age_drop_df = player_age_df.drop_duplicates(subset='SN')

In [31]:
bin_9_count = len(player_age_drop_df.loc[(player_age_drop_df["Age"] < 10)])

In [32]:
bin_9_percentage = bin_9_count / total_players * 100

In [33]:
bin_14_count = len(player_age_drop_df.loc[(player_age_drop_df["Age"] > 9) & 
                                     (player_age_df["Age"] < 15)])

In [34]:
bin_14_percentage = bin_14_count / total_players * 100

In [35]:
bin_19_count = len(player_age_drop_df.loc[(player_age_drop_df["Age"] > 14) & 
                                     (player_age_df["Age"] < 20)])

In [36]:
bin_19_percentage = bin_19_count / total_players * 100

In [37]:
bin_24_count = len(player_age_drop_df.loc[(player_age_drop_df["Age"] > 19) & 
                                     (player_age_df["Age"] < 25)])

In [38]:
bin_24_percentage = bin_24_count / total_players * 100

In [39]:
bin_29_count = len(player_age_drop_df.loc[(player_age_drop_df["Age"] > 24) & 
                                     (player_age_df["Age"] < 30)])

In [40]:
bin_29_percentage = bin_29_count / total_players * 100

In [41]:
bin_34_count = len(player_age_drop_df.loc[(player_age_drop_df["Age"] > 29) & 
                                     (player_age_df["Age"] < 35)])

In [42]:
bin_34_percentage = bin_34_count / total_players * 100

In [43]:
bin_39_count = len(player_age_drop_df.loc[(player_age_drop_df["Age"] > 34) & 
                                     (player_age_df["Age"] < 40)])

In [44]:
bin_39_percentage = bin_39_count / total_players * 100

In [45]:
bin_40_count = len(player_age_drop_df.loc[(player_age_drop_df["Age"] > 39)])

In [46]:
bin_40_percentage = bin_40_count / total_players * 100

In [47]:
### The groupby groups the data by bins

## player_age_group_df = player_age_drop_df.groupby("Age Demographics").count()['Age']
player_age_group_df = player_age_drop_df.groupby("Age Demographics").count()

In [48]:
player_age_group_df

                   SN  Age
Age Demographics
<10                17   17
10-14              22   22
15-19             107  107
20-24             258  258
25-29              77   77
30-34              52   52
35-39              31   31
40+                12   12

In [49]:
player_age_group_df.reset_index()
player_age_group_df

                   SN  Age
Age Demographics
<10                17   17
10-14              22   22
15-19             107  107
20-24             258  258
25-29              77   77
30-34              52   52
35-39              31   31
40+                12   12

In [50]:
# create new dataframe holding percentage of players by age groupings so we can merge wth the groupby dataframe above

percent_by_age_bins_df = pd.DataFrame({ "Age Demographics":["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"],
             "Percentage of Players": [bin_9_percentage,bin_14_percentage,bin_19_percentage,bin_24_percentage, 
                                      bin_29_percentage,bin_34_percentage,bin_39_percentage, bin_40_percentage]})
                                       
percent_by_age_bins_df

  Age Demographics  Percentage of Players
0              <10               2.951389
1            10-14               3.819444
2            15-19              18.576389
3            20-24              44.791667
4            25-29              13.368056
5            30-34               9.027778
6            35-39               5.381944
7              40+               2.083333

In [51]:
###  merge the 2 dataframes and format the output

merge_age_bins_df = pd.merge(percent_by_age_bins_df, player_age_group_df, on="Age Demographics")
merge_age_bins_df

  Age Demographics  Percentage of Players   SN  Age
0              <10               2.951389   17   17
1            10-14               3.819444   22   22
2            15-19              18.576389  107  107
3            20-24              44.791667  258  258
4            25-29              13.368056   77   77
5            30-34               9.027778   52   52
6            35-39               5.381944   31   31
7              40+               2.083333   12   12

In [52]:
del merge_age_bins_df['Age']
merge_age_bins_df

  Age Demographics  Percentage of Players   SN
0              <10               2.951389   17
1            10-14               3.819444   22
2            15-19              18.576389  107
3            20-24              44.791667  258
4            25-29              13.368056   77
5            30-34               9.027778   52
6            35-39               5.381944   31
7              40+               2.083333   12

In [53]:
merge_age_bins_df = merge_age_bins_df.rename(columns={"SN": "Total Count"})
merge_age_bins_df

  Age Demographics  Percentage of Players  Total Count
0              <10               2.951389           17
1            10-14               3.819444           22
2            15-19              18.576389          107
3            20-24              44.791667          258
4            25-29              13.368056           77
5            30-34               9.027778           52
6            35-39               5.381944           31
7              40+               2.083333           12

In [54]:
# format the percentage and reorder the columns for the display

merge_age_bins_df["Percentage of Players"] = merge_age_bins_df["Percentage of Players"].map("{:.2f}%".format)
reorg_merge_age_bins_df = merge_age_bins_df[["Age Demographics", "Total Count", "Percentage of Players"]]

In [55]:

#merge_age_bins_df = merge_age_bins_df.rename(columns={"Age Demographics": " "})

reorg_merge_age_bins_df_index = reorg_merge_age_bins_df.set_index("Age Demographics")
reorg_merge_age_bins_df_index

                  Total Count Percentage of Players
Age Demographics
<10                        17                 2.95%
10-14                      22                 3.82%
15-19                     107                18.58%
20-24                     258                44.79%
25-29                      77                13.37%
30-34                      52                 9.03%
35-39                      31                 5.38%
40+                        12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [56]:
###  Set up bins to determine Purchase Analysis by Age
# Create a new dataframe

bins = [0, 9, 14, 19, 24, 29, 34, 39, 80]

group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

purchase_data_df["Age Ranges"] = pd.cut(purchase_data_df["Age"], bins, labels=group_names,include_lowest=True)
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
467,467,Adairialis76,16,Male,123,Twilight's Carver,2.28,15-19
142,142,Adastirin33,35,Female,175,Woeful Adamantite Claymore,4.48,35-39
388,388,Aeda94,17,Male,128,"Blazeguard, Reach of Eternity",4.91,15-19
28,28,Aela59,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",4.32,20-24
630,630,Aelaria33,23,Male,171,Scalpel,1.79,20-24
...,...,...,...,...,...,...,...,...
54,54,Zhisrisu83,10,Male,25,Hero Cane,4.35,10-14
141,141,Zhisrisu83,10,Male,60,Wolf,3.54,10-14
560,560,Zontibe81,21,Male,2,Verdict,2.48,20-24
442,442,Zontibe81,21,Male,84,Arcane Gem,3.79,20-24
17,17,Zontibe81,21,Male,161,Devine,1.76,20-24

In [57]:
#  Create a Groupby Object based on Age Ranges
player_age_group_count_df = purchase_data_df.groupby("Age Ranges")
player_age_group_count_df.count()

            Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Age Ranges
<10                  23   23   23      23       23         23     23
10-14                28   28   28      28       28         28     28
15-19               136  136  136     136      136        136    136
20-24               365  365  365     365      365        365    365
25-29               101  101  101     101      101        101    101
30-34                73   73   73      73       73         73     73
35-39                41   41   41      41       41         41     41
40+                  13   13   13      13       13         13     13

In [58]:
# Count how many items were purchased for each age group; 
purchase_count_age_df = purchase_data_df.groupby("Age Ranges")["Item ID"]
purchase_count_age_df.count()

Age Ranges
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Item ID, dtype: int64

In [59]:
# Count how many individuals made purchases in each age group; 
purchase_count_age_df = purchase_data_df.groupby("Age Ranges")["SN"]
purchase_count_age_df.nunique()

Age Ranges
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [60]:
#  Find the average purchase price
avg_purchase_price_age_df = purchase_data_df.groupby("Age Ranges")["Price"].mean()
avg_purchase_price_age_df

Age Ranges
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [61]:
#  Find the total purchase value by age range
tot_purchase_price_age_df = purchase_data_df.groupby("Age Ranges")["Price"].sum()
tot_purchase_price_age_df

Age Ranges
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [62]:

# Find the avg purchase per person in the age group
avg_purchase_per_person_age_df = tot_purchase_price_age_df/purchase_count_age_df.nunique()
avg_purchase_per_person_age_df.round(2)

Age Ranges
<10      4.54
10-14    3.76
15-19    3.86
20-24    4.32
25-29    3.81
30-34    4.12
35-39    4.76
40+      3.19
dtype: float64

In [63]:

# Create dataframe by combining the above dataframes

purch_analy_df = pd.DataFrame({"Purchase Count": purchase_count_age_df.count(),
                                "Average Purchase Price": avg_purchase_price_age_df,
                                "Total Purchase Value": tot_purchase_price_age_df,
                                "Avg Total Purchase per Person": avg_purchase_per_person_age_df}) 

purch_analy_df["Average Purchase Price"] = purch_analy_df["Average Purchase Price"].map("${:.2f}".format)
purch_analy_df["Total Purchase Value"] = purch_analy_df["Total Purchase Value"].map("${:.2f}".format)
purch_analy_df["Avg Total Purchase per Person"] = purch_analy_df["Avg Total Purchase per Person"].map("${:.2f}".format)
purch_analy_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,$1114.06,$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [64]:
#  Create a Groupby Object based on Players
player_purchase_count_df = purchase_data_df.groupby("SN")["Price"].count()
player_purchase_count_df

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Price, Length: 576, dtype: int64

In [65]:
#  Create a Groupby Object based on Players
player_purchase_avg_df = purchase_data_df.groupby("SN")["Price"].mean()
player_purchase_avg_df

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [66]:
#  Create a Groupby Object based on Players
player_purchase_total_df = purchase_data_df.groupby("SN")["Price"].sum()
player_purchase_total_df

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [67]:
# Create dataframe by combining the above dataframes

top_spenders_df = pd.DataFrame({"Purchase Count": player_purchase_count_df,
                                "Average Purchase Price": player_purchase_avg_df,
                                "Total Purchase Value": player_purchase_total_df})

# The stmts below sorts the dataframe 
sorted_df = top_spenders_df.sort_values(by=["Total Purchase Value"], ascending=False)

sorted_df["Average Purchase Price"] = sorted_df["Average Purchase Price"].map("${:.2f}".format)
sorted_df["Total Purchase Value"] = sorted_df["Total Purchase Value"].map("${:.2f}".format)
sorted_df

#sn = purchase_data_df.loc[purchase_data_df["SN"] == "Lisosia93",:]
#print(sn)

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.41               $13.62
Iskadarya95               3                  $4.37               $13.10
...                     ...                    ...                  ...
Ililsasya43               1                  $1.02                $1.02
Irilis75                  1                  $1.02                $1.02
Aidai61                   1                  $1.01                $1.01
Chanirra79                1                  $1.01                $1.01
Alo38                     1                  $1.00                $1.00

[576 rows x 3 columns]

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [68]:
# create a dataframe with items with counts

item_purchase_count_df = purchase_data_df.groupby(["Item ID","Item Name"]).count()["Price"].rename("Purchase Count")
item_purchase_count_df

Item ID  Item Name
0        Splinter                           4
1        Crucifer                           3
2        Verdict                            6
3        Phantomlight                       6
4        Bloodlord's Fetish                 5
                                           ..
179      Wolf, Promise of the Moonwalker    6
180      Stormcaller                        1
181      Reaper's Toll                      5
182      Toothpick                          3
183      Dragon's Greatsword                3
Name: Purchase Count, Length: 183, dtype: int64

In [69]:
# create a dataframe with items and avg price

item_avg_price_df = purchase_data_df.groupby(["Item ID","Item Name"]).mean()["Price"].rename("Average Purchase Price")
item_avg_price_df

Item ID  Item Name
0        Splinter                           1.28
1        Crucifer                           3.26
2        Verdict                            2.48
3        Phantomlight                       2.49
4        Bloodlord's Fetish                 1.70
                                            ...
179      Wolf, Promise of the Moonwalker    4.48
180      Stormcaller                        3.36
181      Reaper's Toll                      1.66
182      Toothpick                          4.03
183      Dragon's Greatsword                1.09
Name: Average Purchase Price, Length: 183, dtype: float64

In [70]:
# create a dataframe with items and totol value

item_val_total_df = purchase_data_df.groupby(["Item ID","Item Name"]).sum()["Price"].rename("Total Purchase Value")
item_val_total_df

Item ID  Item Name
0        Splinter                            5.12
1        Crucifer                            9.78
2        Verdict                            14.88
3        Phantomlight                       14.94
4        Bloodlord's Fetish                  8.50
                                            ...
179      Wolf, Promise of the Moonwalker    26.88
180      Stormcaller                         3.36
181      Reaper's Toll                       8.30
182      Toothpick                          12.09
183      Dragon's Greatsword                 3.27
Name: Total Purchase Value, Length: 183, dtype: float64

In [71]:
# Create dataframe by combining the above dataframes

most_pop_items_df = pd.DataFrame({"Purchase Count": item_purchase_count_df,
                                "Item Price": item_avg_price_df,
                                "Total Purchase Value": item_val_total_df})
#most_pop_items_df

In [72]:
# The stmts below sorts the dataframe 
sorted2_df = most_pop_items_df.sort_values(by=["Purchase Count"], ascending=False)

sorted2_df["Item Price"] = sorted2_df["Item Price"].map("${:.2f}".format)
sorted2_df["Total Purchase Value"] = sorted2_df["Total Purchase Value"].map("${:.2f}".format)
sorted2_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [73]:
# The stmts below sorts the dataframe 
sorted2_df = most_pop_items_df.sort_values(by=["Total Purchase Value"], ascending=False)

sorted2_df["Item Price"] = sorted2_df["Item Price"].map("${:.2f}".format)
sorted2_df["Total Purchase Value"] = sorted2_df["Total Purchase Value"].map("${:.2f}".format)
sorted2_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80